{
    "experience": [
        {
            "companyName": "WebPresented",
            "companyTitle": "Systems Engineer",
            "experienceTime": "September 2021 - Present",
            "responsibilities": [
                "At my current role, I work as a Systems Engineer on the Support Team.",
                "I develop and support custom solutions for WebPresented's customers using C#, HTML, CSS, Vue.js, and T-SQL to accomplish my tasks."
            ]
        },
        {
            "companyName": "Sogeti - USA",
            "companyTitle": "Consultant",
            "experienceTime": "June 2019 - September 2021",
            "responsibilities": [
                "As a consultant at Sogeti, I had the pleasure of working for several brands on their front end.",
                "maurices: I was both an A/B tester and a front-end developer for maurices, using a stack including JavaScript(ES5/6), TypeScript, HTML5, CSS3 and SCSS. I conducted many customer facing tests on the maurices website, and used the data collected from those tests to fuel future experiences and optimizations. I also followed guidelines for WCAG2 and ADA compliance to ensure as many people as possible could experience the content I created. To stay organized, I used Atlassian JIRA to receive and proritize tasks as well as to communicate with stakeholders, and Atlassian Confluence to document his code and processes.",
                "Abbott Laboratories: I helped update WebNova, a baby formula calculation application used in neonatal care. The update included an ASP.NET upgrade from 3.5 to 4.7.1, while also updating their front-end for IE11 compatibility. I used JavaScript(ES5), HTML5, CSS3, and C# as the tech stack.",
                "Justice: I worked on the homepage and banners using HTML5, CSS3, and JavaScript(ES5). I also rewrote their size charts to be responsive and easier to understand.",
                "DressBarn: I was a front end developer using a JavaScript(ES5), HTML5, and CSS3 stack."
            ]
        },
        {
            "companyName": "OCLC",
            "companyTitle": "Network Intern",
            "experienceTime": "May 2018 - August 2018",
            "responsibilities": [
                "As a Network Intern for OCLC, my responsibilities included:",
                "Mapping the topology of the network across multiple sites.",
                "Conducting VPC audits.",
                "Configuring Cisco IOS & Meraki network switches."
            ]
        },
        {
            "companyName": "MAPFRE Stadium (Now Historic Crew Stadium)",
            "companyTitle": "IT Intern",
            "experienceTime": "June 2017 - August 2017",
            "responsibilities": [
                "At MAPFRE Stadium I managed virtual machines and provided technical support for over 90 employees.",
                "Tools I used included VMWare, Microsoft Office, Windows, and Linux"
            ]
        },
        {
            "companyName": "Revolution Group",
            "companyTitle": "IT Intern",
            "experienceTime": "May 2016 - August 2016",
            "responsibilities": [
                "At Revolution group Ian had the following responsibilities:",
                "Providing technical support for over 70 companies in and around Ohio.",
                "Remotely updating software.",
                "Setting up hardware for clients."
            ]
        }
    ],
    "education": [
        {
            "schoolName": "Miami University",
            "graduateLevel": "Undergraduate",
            "degreeEarned": "Bachelor of Science in Computer Science, 3.52 GPA",
            "educationTime": "August 2015 - May 2019"
        }
    ],
    "skills": [
        "Javascript - Advanced",
        "HTML5 - Advanced",
        "CSS3 - Advanced",
        "Git, Github, Bitbucket - Advanced",
        "WCAG2 and ADA Compliance - Advanced",
        "TypeScript - Intermediate",
        "React.js - Intermediate",
        "Vue.js - Intermediate",
        "NodeJS/npm - Intermediate",
        "C# - Intermediate",
        "MSSQL Server - Intermediate",
        "SCSS - Novice",
        "PHP - Novice",
        "MySQL/MariaDB - Novice",
        "VMWare/Virtual Box - Novice",
        "MacOS, Linux, and Windows - Intermediate",
        "Microsoft Office Suite - Intermediate",
        "Microsoft Visio - Novice"
    ]
}